Revit 2027 API
Alignment.GetDisplayedHorizontalCurveEndpoints Method
 Returns the endpoints of the alignment's horizontal curves. Only the points between DisplayedStartStation and DisplayedEndStation are returned.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<HorizontalCurveEndpoint> GetDisplayedHorizontalCurveEndpoints()
Public Function GetDisplayedHorizontalCurveEndpoints As IList(Of HorizontalCurveEndpoint)
public:
IList<HorizontalCurveEndpoint^>^ GetDisplayedHorizontalCurveEndpoints()
member GetDisplayedHorizontalCurveEndpoints : unit -> IList<HorizontalCurveEndpoint>
Return Value
IList<HorizontalCurveEndpoint>
See Also
Reference
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace